CSI API ETABS v1
cSapModel.SetPresentUnits_2 Method
 Sets the present units for the model
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetPresentUnits_2(
	eForce forceUnits,
	eLength lengthUnits,
	eTemperature temperatureUnits
)
Function SetPresentUnits_2 (
	forceUnits As eForce,
	lengthUnits As eLength,
	temperatureUnits As eTemperature
) As Integer
Dim instance As cSapModel
Dim forceUnits As eForce
Dim lengthUnits As eLength
Dim temperatureUnits As eTemperature
Dim returnValue As Integer
returnValue = instance.SetPresentUnits_2(forceUnits,
	lengthUnits, temperatureUnits)
int SetPresentUnits_2(
	eForce forceUnits,
	eLength lengthUnits,
	eTemperature temperatureUnits
)
abstract SetPresentUnits_2 :
        forceUnits : eForce *
        lengthUnits : eLength *
        temperatureUnits : eTemperature -> int
Parameters
forceUnits
Type: ETABSv1.eForce
 A value from the eForce enumeration
lengthUnits
Type: ETABSv1.eLength
 A value from the eLength enumeration
temperatureUnits
Type: ETABSv1.eTemperature
 A value from the eTemperature enumeration
Return Value
Type: Int32
 Returns zero if the present units are successfully set, otherwise returns nonzero
Remarks
 Please note that the present units are for data transmitted through the API. They are independent of the units that are displayed in the GUI.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'set present units
    ret = SapModel.SetPresentUnits_2(eForce.kN, eLength.m, eTemperature.C)
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get present units
       Dim forceUnits As eForce
       Dim lengthUnits As eLength
       Dim temperatureUnits As eTemperature
       ret = SapModel.GetPresentUnits_2(forceUnits, lengthUnits, temperatureUnits)
   'run model (this will create the analysis model)
       ret = SapModel.Analyze.RunAnalysis
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cSapModel Interface
ETABSv1 Namespace